In [3]:
import pandas as pd
df = pd.read_csv('titanic.csv')
df.head()

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

istenmeyen kolonu veya satırı atma axis=1 kolonu, axis=o satırı siler

In [ ]:
df.drop(labels=['SexCode'], axis=1, inplace=True )

In [11]:
df.head()

,Name,PClass,Age,Sex,Survived
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0
4,"Allison, Master Hudson Trevor",1st,0.92,male,1

farklı maskeleme. burada yazıyom çünkü öyle gerekti.

df['Sex'] != 'male'                          erkek olmayanları seç
df[df['Sex'] != 'male'].index                erkek olmayanların indexini al
df.drop(df[df['Sex'] != 'male'].index)       erkek olmayanları kaldır/ at

dublicate verileri atma. yani tüm değerleri aynı olan satırlar diyebiliriz.

In [ ]:
df.drop_duplicates()

biraz daha matematşk yapak.

In [18]:
df.groupby(by =['Sex']).count()

        Name  PClass  Age  Survived
Sex
female   462     462  288       462
male     851     851  468       851

In [21]:
df.groupby(by =['Sex', 'Survived']).count()

                 Name  PClass  Age
Sex    Survived
female 0          154     154   71
       1          308     308  217
male   0          709     709  372
       1          142     142   96

for döngüsü

In [26]:
for name in df['Name'][:13]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE
ALLISON, MR HUDSON JOSHUA CREIGHTON
ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
ALLISON, MASTER HUDSON TREVOR
ANDERSON, MR HARRY
ANDREWS, MISS KORNELIA THEODOSIA
ANDREWS, MR THOMAS, JR
APPLETON, MRS EDWARD DALE (CHARLOTTE LAMSON)
ARTAGAVEYTIA, MR RAMON
ASTOR, COLONEL JOHN JACOB
ASTOR, MRS JOHN JACOB (MADELEINE TALMADGE FORCE)
AUBERT, MRS LEONTINE PAULINE

In [28]:
def uppercase(x):
    return x.upper()

In [29]:
df['Name'].apply(uppercase)

0                        ALLEN, MISS ELISABETH WALTON
1                         ALLISON, MISS HELEN LORAINE
2                 ALLISON, MR HUDSON JOSHUA CREIGHTON
3       ALLISON, MRS HUDSON JC (BESSIE WALDO DANIELS)
4                       ALLISON, MASTER HUDSON TREVOR
                            ...
1308                               ZAKARIAN, MR ARTUN
1309                           ZAKARIAN, MR MAPRIEDER
1310                                 ZENNI, MR PHILIP
1311                                 LIEVENS, MR RENE
1312                                   ZIMMERMAN, LEO
Name: Name, Length: 1313, dtype: object